{
  "npcs": [
    {
      "name": "Dr. Elias Vance",
      "emoji": "👨‍⚕️",
      "age": 42,
      "background": "Former trauma surgeon who lost his family in the early days of the outbreak. Now uses his medical skills to barter for supplies and information.",
      "description": "Tall and lean with salt-and-pepper hair tied back in a short ponytail. His piercing blue eyes and calm demeanor mask a sharp, calculating mind. Speaks softly but carries an air of quiet authority.",
      "motivation": "To create a network of safe trade routes where knowledge and medical supplies can flow freely between survivor groups.",
      "skills": [
        "Advanced medical knowledge",
        "Negotiation",
        "Field surgery",
        "Herbal remedy preparation"
      ],
      "items": [
        "A leather-bound journal of zombie bite reactions and treatments",
        "A silver pocket watch that belonged to his late wife",
        "A custom-made bone saw for emergency amputations"
      ],
      "quirk": "Always hums old jazz tunes while working, even during high-stress situations.",
      "secret": "He's secretly developing an experimental vaccine using spinal fluid harvested from special infected, but hasn't told anyone about the dangerous side effects he's observed.",
      "id": "npc_1",
      "discovered_day": 15,
      "faction_id": "faction_1",
      "faction_name": "The Caravan Collective",
      "status": "alive",
      "relationship": -10
    },
    {
      "name": "Marcus 'Ironprice' Holloway",
      "emoji": "🪖",
      "age": 42,
      "background": "Former Marine Corps logistics officer who specialized in supply chain management. After the outbreak, he put his skills to use keeping trade routes open.",
      "description": "A broad-shouldered man with a salt-and-pepper beard and a permanent squint from years of scanning horizons. Speaks in measured tones but has a dry wit that surfaces unexpectedly.",
      "motivation": "Believes civilization can be rebuilt one trade deal at a time, and will protect caravan routes at all costs.",
      "skills": [
        "Route planning",
        "Crisis negotiation",
        "Defensive driving",
        "Weapons maintenance"
      ],
      "items": [
        "A modified GPS unit with safe routes mapped",
        "A silver Zippo with 'Semper Fi' engraved",
        "A ledger of every trade deal he's brokered"
      ],
      "quirk": "Always carries a small scale to weigh goods, even when it's clearly unnecessary.",
      "secret": "He's been skimming small percentages from trades to build an emergency stockpile, convinced the Collective's idealism will get them all killed.",
      "id": "npc_2",
      "discovered_day": 15,
      "faction_id": "faction_1",
      "faction_name": "The Caravan Collective",
      "status": "alive",
      "relationship": -31
    },
    {
      "name": "Marcus 'Hawk' Callahan",
      "emoji": "🦅",
      "age": 42,
      "background": "Former Army Ranger turned private security contractor. Specialized in high-risk convoy protection in conflict zones before the outbreak.",
      "description": "A grizzled man with a shaved head and a network of scars across his forearms. His piercing blue eyes constantly scan for threats, but he speaks with surprising warmth when negotiating deals. Wears a modified tactical vest with caravan insignia.",
      "motivation": "Believes secure trade routes are the only way to prevent humanity from descending into complete barbarism. Secretly hopes to find his estranged daughter among the survivor settlements.",
      "skills": [
        "Convoy defense tactics",
        "Hand-to-hand combat",
        "Negotiation under pressure",
        "Improvised weapon crafting"
      ],
      "items": [
        "Customized ballistic briefcase (doubles as shield)",
        "Dog-eared ledger of trade routes and safehouses",
        "Pre-war military issue compass that always points north"
      ],
      "quirk": "Constantly fidgets with a silver challenge coin from his Ranger days, flipping it between his fingers during tense moments.",
      "secret": "His caravan accidentally transported the infected that overran the Greenbrier settlement, though he's convinced it was sabotage by a rival faction.",
      "id": "npc_3",
      "discovered_day": 15,
      "faction_id": "faction_1",
      "faction_name": "The Caravan Collective",
      "status": "alive",
      "relationship": 31
    },
    {
      "name": "Eleanor 'Ellie' Whitmore",
      "emoji": "👩‍🏫",
      "age": 42,
      "background": "Former high school history teacher who specialized in ancient trade routes and barter economies. She secretly ran an underground book exchange for banned historical texts.",
      "description": "A wiry woman with salt-and-pepper hair kept in a practical braid, her sharp green eyes always scanning for opportunities. She speaks with measured precision but has a warm, encouraging tone that disarms strangers.",
      "motivation": "To rebuild civilization through a network of safe trade routes, proving humanity can cooperate even in darkness.",
      "skills": [
        "Bartering & negotiation",
        "Historical knowledge of trade systems",
        "Basic first aid",
        "Persuasive storytelling"
      ],
      "items": [
        "A dog-eared copy of 'The Silk Road: A History'",
        "A brass compass that always points to the last safe trade post",
        "A hidden ledger of favors owed"
      ],
      "quirk": "Constantly makes historical comparisons to current situations ('This reminds me of when the Phoenicians...')",
      "secret": "Her underground book exchange accidentally spread the first rumors of the coming apocalypse - she blames herself for not sounding the alarm sooner.",
      "id": "npc_4",
      "discovered_day": 15,
      "faction_id": "faction_1",
      "faction_name": "The Caravan Collective",
      "status": "alive",
      "relationship": -22
    },
    {
      "name": "Eleanor 'Ellie' Grayson",
      "age": 42,
      "background": "Former high school history teacher who specialized in ancient trade routes and barter economies. Her academic knowledge became unexpectedly valuable after the collapse.",
      "description": "A wiry woman with salt-and-pepper hair tied in a practical braid, deep crow's feet from squinting at blackboards (and now at threats in the fog). Speaks with measured precision but has a dark, unexpected humor that surfaces at tense moments.",
      "motivation": "To prove civilization can be rebuilt through commerce rather than violence, secretly compiling a 'New Merchant's Guide' with survivalist annotations.",
      "skills": [
        "Barter negotiation",
        "Mapmaking/cartography",
        "Basic first aid",
        "Spotting valuable artifacts in ruins"
      ],
      "items": [
        "A laminated pre-collapse world map with handwritten trade routes",
        "A hollowed-out textbook containing hidden seeds",
        "A brass bell used to announce 'store hours' at trading posts"
      ],
      "quirk": "Absentmindedly writes prices in the air with her finger when evaluating items, even during life-or-death situations.",
      "secret": "Her 'merchant ledger' contains coded locations of hidden caches... including ones she looted from other survivors during the early chaos.",
      "id": "npc_5",
      "faction_id": "faction_1",
      "faction_name": "The Caravan Collective",
      "status": "alive",
      "relationship": 14
    },
    {
      "name": "Eleanor 'Ellie' Grayson",
      "age": 42,
      "background": "Former high school history teacher who specialized in ancient trade routes and barter economies. Her academic knowledge became unexpectedly valuable after the collapse.",
      "description": "A wiry woman with salt-and-pepper hair tied in a practical braid, deep crow's feet from squinting at blackboards (and now at threats in the fog). Speaks with measured precision but has a dark, unexpected humor that surfaces at tense moments.",
      "motivation": "To prove civilization can be rebuilt through commerce rather than violence, secretly compiling a 'New Merchant's Guide' with survivalist annotations.",
      "skills": [
        "Barter negotiation",
        "Mapmaking/cartography",
        "Basic first aid",
        "Spotting valuable artifacts in ruins"
      ],
      "items": [
        "A laminated pre-collapse world map with handwritten trade routes",
        "A hollowed-out textbook containing hidden seeds",
        "A brass bell used to announce 'store hours' at trading posts"
      ],
      "quirk": "Absentmindedly writes prices in the air with her finger when evaluating items, even during life-or-death situations.",
      "secret": "Her 'merchant ledger' contains coded locations of hidden caches... including ones she looted from other survivors during the early chaos.",
      "id": "npc_6",
      "faction_id": "faction_1",
      "faction_name": "The Caravan Collective",
      "status": "alive",
      "relationship": 14,
      "discovered_day": 12
    }
  ],
  "next_id": 5
}